RolandWa/wireless-esp8266-dap/main/wifi_handle.c
#include "sdkconfig.h"

#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include <sys/param.h>

#include "main/wifi_configuration.h"
#include "main/uart_bridge.h"

#include "components/DAP/include/gpio_op.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/event_groups.h"
#include "esp_system.h"
#include "esp_wifi.h"
#include "esp_event_loop.h"
#include "esp_log.h"

#if (USE_STATIC_IP == 1)
#include "lwip/sockets.h"
#include "lwip/netdb.h"

// ICMP echo request header (RFC 792)
typedef struct {
    uint8_t  type;
    uint8_t  code;
    uint16_t checksum;
    uint16_t id;
    uint16_t seq;
} icmp_hdr_t;

static uint16_t icmp_checksum(void *data, int len) {
    uint16_t *p = (uint16_t *)data;
    uint32_t sum = 0;
    while (len > 1) { sum += *p++; len -= 2; }
    if (len)         sum += *(uint8_t *)p;
    while (sum >> 16) sum = (sum & 0xFFFF) + (sum >> 16);
    return (uint16_t)(~sum);
}

// Returns true if another host replies to a ping at ip_str within timeout_ms.
static bool ip_in_use(const char *ip_str, int timeout_ms) {
    int sock = socket(AF_INET, SOCK_RAW, IPPROTO_ICMP);
    if (sock < 0) return false;

    struct timeval tv = {
        .tv_sec  = timeout_ms / 1000,
        .tv_usec = (timeout_ms % 1000) * 1000,
    };
    setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));

    struct sockaddr_in dest;
    memset(&dest, 0, sizeof(dest));
    dest.sin_family = AF_INET;
    inet_aton(ip_str, &dest.sin_addr);

    uint8_t pkt[sizeof(icmp_hdr_t)];
    icmp_hdr_t *icmp = (icmp_hdr_t *)pkt;
    icmp->type     = 8;   // ICMP_ECHO
    icmp->code     = 0;
    icmp->id       = htons(0xDA99);
    icmp->seq      = htons(1);
    icmp->checksum = 0;
    icmp->checksum = icmp_checksum(pkt, sizeof(pkt));

    sendto(sock, pkt, sizeof(pkt), 0, (struct sockaddr *)&dest, sizeof(dest));

    // Any reply means the address is occupied
    uint8_t reply[64];
    int n = recv(sock, reply, sizeof(reply), 0);
    close(sock);
    return (n > 0);
}

// Expand DAP_IP_ADDRESS / DAP_IP_GATEWAY / DAP_IP_NETMASK macros into arrays.
static const uint8_t s_def_ip[] = { DAP_IP_ADDRESS };
static const uint8_t s_def_gw[] = { DAP_IP_GATEWAY };
static const uint8_t s_def_nm[] = { DAP_IP_NETMASK };

// Connect first with DHCP, then probe for the first free static IP starting
// at the configured default. Increments the last octet up to 255.
static void find_and_set_free_static_ip(void) {
    char candidate[16];

    for (int octet = s_def_ip[3]; octet <= 255; octet++) {
        snprintf(candidate, sizeof(candidate), "%d.%d.%d.%d",
                 s_def_ip[0], s_def_ip[1], s_def_ip[2], octet);

        os_printf("Static IP probe: checking %s ...\r\n", candidate);

        if (!ip_in_use(candidate, 400)) {
            // Address appears free — stop DHCP and apply it
            tcpip_adapter_ip_info_t info;
            inet_aton(candidate, &info.ip);
            IP4_ADDR(&info.gw,      s_def_gw[0], s_def_gw[1], s_def_gw[2], s_def_gw[3]);
            IP4_ADDR(&info.netmask, s_def_nm[0], s_def_nm[1], s_def_nm[2], s_def_nm[3]);

            tcpip_adapter_dhcpc_stop(TCPIP_ADAPTER_IF_STA);
            tcpip_adapter_set_ip_info(TCPIP_ADAPTER_IF_STA, &info);

            os_printf("Static IP assigned: %s (default was %d.%d.%d.%d)\r\n",
                      candidate,
                      s_def_ip[0], s_def_ip[1], s_def_ip[2], s_def_ip[3]);
            return;
        }

        os_printf("Static IP probe: %s is taken\r\n", candidate);

        if (octet == 255) {
            os_printf("Static IP probe: no free address found in .%d-.255, keeping DHCP\r\n",
                      s_def_ip[3]);
        }
    }
}
#endif // USE_STATIC_IP

#ifdef CONFIG_IDF_TARGET_ESP8266
    #define PIN_LED_WIFI_STATUS 15
#elif defined CONFIG_IDF_TARGET_ESP32
    #define PIN_LED_WIFI_STATUS 27
#elif defined CONFIG_IDF_TARGET_ESP32C3
    #define PIN_LED_WIFI_STATUS 10
#elif defined CONFIG_IDF_TARGET_ESP32S3
    #define PIN_LED_WIFI_STATUS 4
#else
    #error unknown hardware
#endif

static EventGroupHandle_t wifi_event_group;
static int ssid_index = 0;
static int retry_count = 0;
static bool ap_mode = false;
#define MAX_RETRY_PER_NETWORK 5  // Try each network 5 times

const int IPV4_GOTIP_BIT = BIT0;
#ifdef CONFIG_EXAMPLE_IPV6
const int IPV6_GOTIP_BIT = BIT1;
#endif

static void ssid_change();

static esp_err_t event_handler(void *ctx, system_event_t *event) {
    /* For accessing reason codes in case of disconnection */
    system_event_info_t *info = &event->event_info;

    switch (event->event_id) {
    case SYSTEM_EVENT_STA_START:
        esp_wifi_connect();
        break;
    case SYSTEM_EVENT_STA_CONNECTED:
#ifdef CONFIG_EXAMPLE_IPV6
        /* enable ipv6 */
        tcpip_adapter_create_ip6_linklocal(TCPIP_ADAPTER_IF_STA);
#endif
        break;
    case SYSTEM_EVENT_STA_GOT_IP:
        GPIO_SET_LEVEL_HIGH(PIN_LED_WIFI_STATUS);

        xEventGroupSetBits(wifi_event_group, IPV4_GOTIP_BIT);
        os_printf("SYSTEM EVENT STA GOT IP : %s\r\n", ip4addr_ntoa(&event->event_info.got_ip.ip_info.ip));
        break;
    case SYSTEM_EVENT_STA_DISCONNECTED:
        if (ap_mode) {
            break;  // Don't try to reconnect if we're in AP mode
        }
        
        GPIO_SET_LEVEL_LOW(PIN_LED_WIFI_STATUS);

        os_printf("Disconnect reason : %d\r\n", (int)info->disconnected.reason);

#ifdef CONFIG_IDF_TARGET_ESP8266
        if (info->disconnected.reason == WIFI_REASON_BASIC_RATE_NOT_SUPPORT) {
            /*Switch to 802.11 bgn mode */
            esp_wifi_set_protocol(ESP_IF_WIFI_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N);
        }
#endif
        ssid_change();
        if (!ap_mode) {  // Only reconnect if not switched to AP mode
            esp_wifi_connect();
        }
        xEventGroupClearBits(wifi_event_group, IPV4_GOTIP_BIT);
#ifdef CONFIG_EXAMPLE_IPV6
        xEventGroupClearBits(wifi_event_group, IPV6_GOTIP_BIT);
#endif

#if (USE_UART_BRIDGE == 1)
        uart_bridge_close();
#endif
        break;
    case SYSTEM_EVENT_AP_STA_GOT_IP6:
#ifdef CONFIG_EXAMPLE_IPV6
        xEventGroupSetBits(wifi_event_group, IPV6_GOTIP_BIT);
        os_printf("SYSTEM_EVENT_STA_GOT_IP6\r\n");

        char *ip6 = ip6addr_ntoa(&event->event_info.got_ip6.ip6_info.ip);
        os_printf("IPv6: %s\r\n", ip6);
#endif
    default:
        break;
    }
    return ESP_OK;
}

static void ssid_change() {
    retry_count++;
    
    // After MAX_RETRY_PER_NETWORK attempts for this SSID, move to next
    if (retry_count >= MAX_RETRY_PER_NETWORK) {
        retry_count = 0;
        ssid_index++;
        
        // If we've tried all SSIDs, switch to AP mode using second entry
        if (ssid_index >= WIFI_LIST_SIZE) {
            os_printf("Failed to connect to any network after %d attempts each. Creating AP...\r\n", MAX_RETRY_PER_NETWORK);
            
            // Stop current connection attempts
            esp_wifi_disconnect();
            esp_wifi_stop();
            
            // Configure AP mode using wifi_list[1] (second entry)
            wifi_config_t ap_config = {
                .ap = {
                    .ssid = "",
                    .password = "",
                    .ssid_len = 0,
                    .channel = 1,
                    .authmode = WIFI_AUTH_WPA2_PSK,
                    .max_connection = 4,
                    .beacon_interval = 100,
                },
            };
            
            // Use the second entry from wifi_list for AP credentials
            strncpy((char *)ap_config.ap.ssid, wifi_list[1].ssid, sizeof(ap_config.ap.ssid) - 1);
            ap_config.ap.ssid[sizeof(ap_config.ap.ssid) - 1] = '\0';
            strncpy((char *)ap_config.ap.password, wifi_list[1].password, sizeof(ap_config.ap.password) - 1);
            ap_config.ap.password[sizeof(ap_config.ap.password) - 1] = '\0';
            ap_config.ap.ssid_len = strlen((char *)ap_config.ap.ssid);
            
            ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
            ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_AP, &ap_config));
            ESP_ERROR_CHECK(esp_wifi_start());
            
            ap_mode = true;
            GPIO_SET_LEVEL_HIGH(PIN_LED_WIFI_STATUS);
            os_printf("AP Mode: SSID='%s', Password='%s', IP=192.168.4.1\r\n", 
                      wifi_list[1].ssid, wifi_list[1].password);
            
            // Set the IPV4_GOTIP_BIT to unblock wait_for_ip()
            xEventGroupSetBits(wifi_event_group, IPV4_GOTIP_BIT);
            return;
        }
    }

    wifi_config_t wifi_config = {
        .sta = {
            .ssid = "",
            .password = "",
        },
    };

    strncpy((char *)wifi_config.sta.ssid, wifi_list[ssid_index].ssid, sizeof(wifi_config.sta.ssid) - 1);
    wifi_config.sta.ssid[sizeof(wifi_config.sta.ssid) - 1] = '\0';
    strncpy((char *)wifi_config.sta.password, wifi_list[ssid_index].password, sizeof(wifi_config.sta.password) - 1);
    wifi_config.sta.password[sizeof(wifi_config.sta.password) - 1] = '\0';
    os_printf("Trying to connect to: %s (attempt %d/%d)\r\n", 
              wifi_list[ssid_index].ssid, retry_count + 1, MAX_RETRY_PER_NETWORK);
    ESP_ERROR_CHECK(esp_wifi_set_config(ESP_IF_WIFI_STA, &wifi_config));
}

static void wait_for_ip() {
#ifdef CONFIG_EXAMPLE_IPV6
    uint32_t bits = IPV4_GOTIP_BIT | IPV6_GOTIP_BIT;
#else
    uint32_t bits = IPV4_GOTIP_BIT;
#endif

    os_printf("Waiting for AP connection...\r\n");
    xEventGroupWaitBits(wifi_event_group, bits, false, true, portMAX_DELAY);
    os_printf("Connected to AP\r\n");
}

void wifi_init(void) {
    GPIO_FUNCTION_SET(PIN_LED_WIFI_STATUS);
    GPIO_SET_DIRECTION_NORMAL_OUT(PIN_LED_WIFI_STATUS);

    tcpip_adapter_init();

    // Static IP is resolved after connection (see find_and_set_free_static_ip below).
    // DHCP is used initially so the network stack is active for the IP probe.

    wifi_event_group = xEventGroupCreate();

    ESP_ERROR_CHECK(esp_event_loop_init(event_handler, NULL));
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));

    // os_printf("Setting WiFi configuration SSID %s...\r\n", wifi_config.sta.ssid);
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
    ssid_change();
    ESP_ERROR_CHECK(esp_wifi_start());


    wait_for_ip();

#if (USE_STATIC_IP == 1)
    find_and_set_free_static_ip();
#endif
}
